/*
 * _ooOoo_
 * o8888888o
 * 88" . "88
 * (| -_- |)
 *  O\ = /O
 * ___/`---'\____
 * .   ' \\| |// `.
 * / \\||| : |||// \
 * / _||||| -:- |||||- \
 * | | \\\ - /// | |
 * | \_| ''\---/'' | |
 * \ .-\__ `-` ___/-. /
 * ___`. .' /--.--\ `. . __
 * ."" '< `.___\_<|>_/___.' >'"".
 * | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 * `=---='
 *          .............................................
 *           佛曰：bug泛滥，我已瘫痪！
 */

#include "Lex_ana.h"
#include"Ga.h"
#include "LL1.h"
#include<stdlib.h>
#include "cl.h"
int main()
{
	lex_ana("语句输入.txt");system("pause");
	Gram_Anal("词法分析后.txt"); system("pause");
	Clear_Left(); 
	cout << "左递归消除完毕" << endl;
	system("pause");
	LL1 Answer;
	Answer.getResult();
	system("pause");
	return 0;
}